
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммы(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммы(ТекущаяСтрока);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(ВыбраннаяНоменклатура)
	Возврат ВыбраннаяНоменклатура.ЦенаПродажи;
КонецФункции

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)

	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура);
			Если ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			Иначе
				СтрокаТЧ.Количество = 1;
				СтрокаТЧ.Сумма = СтрокаТЧ.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

