Процедура ОбработкаПроведения(Отказ, Режим)
	
	// рег свед. 
	Движения.СостоянияЗаявок.Записывать = Истина;
	ДвижениеСведений = Движения.СостоянияЗаявок.Добавить();
	ДвижениеСведений.Период = Дата;
	ДвижениеСведений.Заявка = Заявка;
	ДвижениеСведений.СтатусЗаявки = Перечисления.СтатусыЗаявок.Выполнена;
	ДвижениеСведений.Исполнитель = Исполнитель;  
	
	// рег. накопл: остатки (расход с фильтром)
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл 
		
		// Фильтр немат. услуги
		Если ТекСтрокаМатериалы.Номенклатура.ТипыНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		ДвижениеСклада = Движения.ОстаткиМатериалов.Добавить();
		ДвижениеСклада.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеСклада.Период = Дата;
		ДвижениеСклада.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		ДвижениеСклада.Склад = Склад;
		ДвижениеСклада.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	// склад и контроль остатков
	Движения.ОстаткиМатериалов.Записать(); 
	
	// контроль остатков только при оперативном проведении
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиМатериаловОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
			|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК Дефицит
			|ИЗ
			|	РегистрНакопления.ОстаткиМатериалов.Остатки(&МоментВремени, Склад = &ТекущийСклад) КАК ОстаткиМатериаловОстатки
			|ГДЕ
			|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0"; // ищем ушедшие в минус товары
		
		// Исп границу, чтобы запрос  увидел движения тек. документа
		ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		ЗапросОстатков.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
		ЗапросОстатков.УстановитьПараметр("ТекущийСклад", Склад);
		
		РезультатКонтроля = ЗапросОстатков.Выполнить(); 
		
		Если Не РезультатКонтроля.Пустой() Тогда
			Отказ = Истина; // отказ если дефицит
			
			ВыборкаМинусов = РезультатКонтроля.Выбрать();
			Пока ВыборкаМинусов.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно товара """ + ВыборкаМинусов.НоменклатураНаименование + """ на складе! Не хватает: " + ВыборкаМинусов.Дефицит + " шт.";
				Сообщение.Сообщить();
			КонецЦикла;
			
			// Если склад в минус - прерываем процедуру
			Возврат; 
		КонецЕсли;
	КонецЕсли;

	// рег. накоп., выполн работы (приход выручки)
	Движения.ВыполненныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		ДвижениеВыручки = Движения.ВыполненныеРаботы.Добавить();
		ДвижениеВыручки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВыручки.Период = Дата;
		ДвижениеВыручки.Клиент = Заказчик;
		ДвижениеВыручки.Исполнитель = Исполнитель;
		ДвижениеВыручки.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		ДвижениеВыручки.Количество = ТекСтрокаМатериалы.Количество;
		ДвижениеВыручки.Сумма = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаКлиента") Тогда
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Заказчик = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Заявка = ДанныеЗаполнения.Ссылка;
		СтатусЗаявки = ДанныеЗаполнения.СтатусЗаявки;
	КонецЕсли;

КонецПроцедуры
