
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаКлиента") Тогда
		// Заполнение шапки
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Заявка = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	СтатусЗаявки = Перечисления.СтатусыЗаявок.Закрыта;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СостоянияЗаявок
	Движения.СостоянияЗаявок.Записывать = Истина;
	Движение = Движения.СостоянияЗаявок.Добавить();
	Движение.Период = Дата;
	Движение.Заявка = Заявка;
	Движение.СтатусЗаявки = СтатусЗаявки;
	Движение.Исполнитель = Исполнитель;
	
КонецПроцедуры
