
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаКлиента") Тогда
		
		Отбор = Новый Структура("Заявка", ДанныеЗаполнения);
		ПоследняяЗапись = РегистрыСведений.СостоянияЗаявок.ПолучитьПоследнее(ТекущаяДата(), Отбор);
		
		СтатусОснования = Перечисления.СтатусыЗаявок.ПустаяСсылка();
		Если ПоследняяЗапись <> Неопределено Тогда
			ПоследняяЗапись.Свойство("СтатусЗаявки", СтатусОснования);
		КонецЕсли;
		
		// Если заявка закрыта или отменена блокируем создание через Исключение
		Если СтатусОснования = Перечисления.СтатусыЗаявок.Закрыта 
			ИЛИ СтатусОснования = Перечисления.СтатусыЗаявок.Отменена Тогда
			ВызватьИсключение "Невозможно создать документ! Заявка-основание уже закрыта или отменена.";
		КонецЕсли;		
		
		// Заполнение шапки
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Заявка = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	СтатусЗаявки = Перечисления.СтатусыЗаявок.Закрыта;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СостоянияЗаявок
	Движения.СостоянияЗаявок.Записывать = Истина;
	Движение = Движения.СостоянияЗаявок.Добавить();
	Движение.Период = Дата;
	Движение.Заявка = Заявка;
	Движение.СтатусЗаявки = СтатусЗаявки;
	Движение.Исполнитель = Исполнитель;
	
КонецПроцедуры
