
Процедура ОбработкаПроведения(Отказ, Режим)  
	
Если ЗначениеЗаполнено(Ссылка) Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияЗаявок.СтатусЗаявки КАК СтатусЗаявки
		|ИЗ
		|	РегистрСведений.СостоянияЗаявок КАК СостоянияЗаявок
		|ГДЕ
		|	СостоянияЗаявок.Заявка = &Ссылка
		|	И СостоянияЗаявок.Регистратор <> &Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияЗаявок.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтатусВРегистре = Выборка.СтатусЗаявки;
		
		Если СтатусВРегистре = Перечисления.СтатусыЗаявок.Закрыта Тогда
			ВызватьИсключение "Действие заблокировано! Данная заявка уже успешно закрыта.";
			
		ИначеЕсли СтатусВРегистре = Перечисления.СтатусыЗаявок.Выполнена Тогда
			ВызватьИсключение "Нельзя перепроводить документ! Работы по этой заявке уже полностью выполнены.";
			
		ИначеЕсли СтатусВРегистре = Перечисления.СтатусыЗаявок.Отменена Тогда
			ВызватьИсключение "Ошибка проведения! Эта заявка была отменена и не подлежит изменению.";
		КонецЕсли;
		
	КонецЕсли;
	
КонецЕсли;	
	
	// Запись в регистр СостоянияЗаявок должна происходить ВСЕГДА
	Движения.СостоянияЗаявок.Записывать = Истина;
	
	Движение = Движения.СостоянияЗаявок.Добавить();
	Движение.Период       = Дата;
	Движение.Заявка       = Ссылка;
	Движение.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая; 
	Движение.Исполнитель  = Исполнитель;
	
	
КонецПроцедуры