
Процедура ОбработкаПроведения(Отказ, Режим)  
	
// 1. Быстро вытаскиваем статус прямо из базы данных (в одну строку)
ТекущийСтатус = РегистрыСведений.СостоянияЗаявок.ПолучитьПоследнее(Дата, Новый Структура("Заявка", Ссылка)).СтатусЗаявки;

// 2. Проверяем: если заявка уже завершена — мгновенно отменяем проведение
Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта ИЛИ 
	ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
	ВызватьИсключение "Нельзя перепроводить заявку! Она уже закрыта или отменена.";
КонецЕсли;
	
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		// регистр СостоянияЗаявок
		Движения.СостоянияЗаявок.Записывать = Истина;
		Движение = Движения.СостоянияЗаявок.Добавить();
		Движение.Период = Дата;
		Движение.Заявка = Ссылка;
		Движение.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая;
		Движение.Исполнитель = Исполнитель;
	КонецЕсли; 
	
КонецПроцедуры