
Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Если ЗначениеЗаполнено(Ссылка) Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаКлиента.СтатусЗаявки КАК СтатусЗаявки
		|ИЗ
		|	Документ.ЗаявкаКлиента КАК ЗаявкаКлиента
		|ГДЕ
		|	ЗаявкаКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СтатусВБазе = Выборка.СтатусЗаявки;
			
			// Проверяем старый статус из базы
			Если СтатусВБазе = Перечисления.СтатусыЗаявок.Закрыта 
				Или СтатусВБазе = Перечисления.СтатусыЗаявок.Выполнена 
				Или СтатусВБазе = Перечисления.СтатусыЗаявок.Отменена Тогда
				ВызватьИсключение "Нельзя перепроводить заявку! Она уже закрыта, выполнена или отменена.";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	// Запись в регистр СостоянияЗаявок должна происходить ВСЕГДА
	Движения.СостоянияЗаявок.Записывать = Истина;
	
	Движение = Движения.СостоянияЗаявок.Добавить();
	Движение.Период       = Дата;
	Движение.Заявка       = Ссылка;
	Движение.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая; 
	Движение.Исполнитель   = Исполнитель;
	
	
КонецПроцедуры