
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммыПокупки(ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммыПокупки(ТекущаяСтрока);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(ВыбраннаяНоменклатура)
	Возврат ВыбраннаяНоменклатура.ЦенаПокупки;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)  
	
		СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтрокаТЧ.ЦенаПокупки = ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура);
			Если ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаПокупки;
			Иначе
				СтрокаТЧ.Количество = 1;
				СтрокаТЧ.Сумма = СтрокаТЧ.ЦенаПокупки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

