&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Закрыта Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыполнениеРабот.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВыполнениеРабот КАК ВыполнениеРабот
			|ГДЕ
			|	ВыполнениеРабот.Заявка = &ТекущаяЗаявка
			|	И ВыполнениеРабот.Проведен = ИСТИНА";
		
		// ссылка на заявку из реквизита тек. объекта
		Запрос.УстановитьПараметр("ТекущаяЗаявка", ТекущийОбъект.Заявка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя закрыть заявку! По ней еще не зарегистрировано выполненных работ.";
			Сообщение.Сообщить();
			
			Отказ = Истина; // Отменяем запись документа
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры
